coocox/Mplib/Toshaba/TMPM33x/TMPM332/cmsis_lib/lib/source/tmpm332_rtc.c
/**
 *******************************************************************************
 * @file    tmpm332_rtc.c
 * @brief   This file provides API functions for RTC driver.
 * @version V2.1.0
 * @date    2010/08/02
 * 
 * THE SOURCE CODE AND ITS RELATED DOCUMENTATION IS PROVIDED "AS IS". TOSHIBA
 * CORPORATION MAKES NO OTHER WARRANTY OF ANY KIND, WHETHER EXPRESS, IMPLIED OR,
 * STATUTORY AND DISCLAIMS ANY AND ALL IMPLIED WARRANTIES OF MERCHANTABILITY,
 * SATISFACTORY QUALITY, NON INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
 * 
 * THE SOURCE CODE AND DOCUMENTATION MAY INCLUDE ERRORS. TOSHIBA CORPORATION
 * RESERVES THE RIGHT TO INCORPORATE MODIFICATIONS TO THE SOURCE CODE IN LATER
 * REVISIONS OF IT, AND TO MAKE IMPROVEMENTS OR CHANGES IN THE DOCUMENTATION OR
 * THE PRODUCTS OR TECHNOLOGIES DESCRIBED THEREIN AT ANY TIME.
 * 
 * TOSHIBA CORPORATION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
 * CONSEQUENTIAL DAMAGE OR LIABILITY ARISING FROM YOUR USE OF THE SOURCE CODE OR
 * ANY DOCUMENTATION, INCLUDING BUT NOT LIMITED TO, LOST REVENUES, DATA OR
 * PROFITS, DAMAGES OF ANY SPECIAL, INCIDENTAL OR CONSEQUENTIAL NATURE, PUNITIVE
 * DAMAGES, LOSS OF PROPERTY OR LOSS OF PROFITS ARISING OUT OF OR IN CONNECTION
 * WITH THIS AGREEMENT, OR BEING UNUSABLE, EVEN IF ADVISED OF THE POSSIBILITY OR
 * PROBABILITY OF SUCH DAMAGES AND WHETHER A CLAIM FOR SUCH DAMAGE IS BASED UPON
 * WARRANTY, CONTRACT, TORT, NEGLIGENCE OR OTHERWISE.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2010 All rights reserved
 *******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "tmpm332_rtc.h"

#if defined(__TMPM330_RTC_H) || defined(__TMPM332_RTC_H) || defined(__TMPM333_RTC_H)
/** @addtogroup TX03_Periph_Driver
  * @{
  */

/** @defgroup RTC 
  * @brief RTC driver modules
  * @{
  */

/** @defgroup RTC_Private_Defines
  * @{
  */

#define PAGER_PAGE_SET         ((uint8_t)0x01)
#define PAGER_PAGE_CLEAR       ((uint8_t)0xEE)
#define PAGER_ADJUST_SET       ((uint8_t)0x10)
#define PAGER_ADJUST_CLEAR     ((uint8_t)0xEF)
#define PAGER_ENATMR_SET       ((uint8_t)0x08)
#define PAGER_ENATMR_CLEAR     ((uint8_t)0xE7)
#define PAGER_ENAALM_SET       ((uint8_t)0x04)
#define PAGER_ENAALM_CLEAR     ((uint8_t)0xEB)
#define PAGER_INTENA_SET       ((uint8_t)0x80)
#define PAGER_INTENA_CLEAR     ((uint8_t)0x6F)

#define RESTR_DIS_CLEAR        ((uint8_t)0x0F)
#define RESTR_DIS1HZ_SET       ((uint8_t)0x80)
#define RESTR_DIS16HZ_SET      ((uint8_t)0x40)
#define RESTR_RSTTMR_SET       ((uint8_t)0x20)
#define RESTR_RSTTMR_CLEAR     ((uint8_t)0xCF)
#define RESTR_RSTALM_SET       ((uint8_t)0x10)
#define RESTR_RSTALM_CLEAR     ((uint8_t)0xCF)

#define HOURR_HO5_SET          ((uint8_t)0x20)
#define HOURR_HO5_CLEAR        ((uint8_t)0xDF)

/** @} */
/* End of group RTC_Private_Defines */


/** @defgroup RTC_Private_FunctionPrototypes
  * @{
  */

/** @} */
/* End of group RTC_Private_FunctionPrototypes */

/** @defgroup RTC_Private_Functions
  * @{
  */

/** @} */
/* End of group group RTC_Private_Functions */

/** @defgroup RTC_Exported_Functions
  * @{
  */

/**
  * @brief  Set the RTC SECR register.
  * @param  Sec: New sec value, max 59
  *   This parameter can be one of the following values:
  *   0, 1, 2, ...59 
  * @retval None
  */
void RTC_SetSec(uint8_t Sec)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_SECOND(Sec));

    /* Select PAGE0 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    TSB_RTC->PAGER = tmp;
    tmp = (uint8_t) ((Sec / 10U) * 16U + Sec % 10U);
    /* Write sec value into SECR register */
    TSB_RTC->SECR = tmp;
}

/**
  * @brief  Get the sec value.
  * @param  None
  * @retval The sec value.
  */
uint8_t RTC_GetSec(void)
{
    uint8_t sec = 0U;
    uint8_t tmp = 0U;

    /* Select PAGE0 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    TSB_RTC->PAGER = tmp;

    do {
        tmp = TSB_RTC->SECR;
        sec = TSB_RTC->SECR;
    }
    while (tmp != sec);

    sec = (uint8_t) ((tmp >> 4U) * 10U + tmp % 16U);

    /* return second value  */
    return sec;
}

/**
  * @brief  Set the RTC MINR register.
  * @param  NewMode: New mode of RTC
  *   This parameter can be one of the following values:
  *   RTC_CLOCK_MODE, RTC_ALARM_MODE 
  * @param  Min: New min value, max 59
  *   This parameter can be one of the following values:
  *   0, 1, 2, ...59 
  * @retval None
  */
void RTC_SetMin(RTC_FuncMode NewMode, uint8_t Min)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_MINUTE(Min));
    assert_param(IS_RTC_FUNC_MODE(NewMode));

    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;

    if (NewMode == RTC_ALARM_MODE) {
        /* Select PAGE1 */
        tmp |= PAGER_PAGE_SET;
    } else {
        /* Select PAGE0 */
        /* Do nothing */
    }

    TSB_RTC->PAGER = tmp;
    tmp = (uint8_t) ((Min / 10U) * 16U + Min % 10U);
    /* Write min value into MINR register */
    TSB_RTC->MINR = tmp;
}

/**
  * @brief  Get the min value.
  * @param  NewMode: New mode of RTC
  *   This parameter can be one of the following values:
  *   RTC_CLOCK_MODE, RTC_ALARM_MODE 
  * @retval The min value.
  */
uint8_t RTC_GetMin(RTC_FuncMode NewMode)
{
    uint8_t min = 0U;
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_FUNC_MODE(NewMode));

    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;

    if (NewMode == RTC_CLOCK_MODE) {
        /* Select PAGE0 */
        TSB_RTC->PAGER = tmp;

        do {
            tmp = TSB_RTC->MINR;
            min = TSB_RTC->MINR;
        }
        while (tmp != min);

    } else {
        /* Select PAGE1 */
        tmp |= PAGER_PAGE_SET;
        TSB_RTC->PAGER = tmp;
        tmp = TSB_RTC->MINR;
    }

    min = (uint8_t) ((tmp >> 4U) * 10U + tmp % 16U);

    /* return minute value  */
    return min;
}

/**
  * @brief  Get AM or PM state in the 12 Hour mode.
  * @param  NewMode: New mode of RTC
  *   This parameter can be one of the following values:
  *   RTC_CLOCK_MODE, RTC_ALARM_MODE
  * @retval mode: The mode of the time.
  *   This parameter can be one of the following values:
  *   RTC_AM_MODE, RTC_PM_MODE 
  */
uint8_t RTC_GetAMPM(RTC_FuncMode NewMode)
{
    uint8_t tmp = 0U;
    uint8_t mode = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_FUNC_MODE(NewMode));

    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;

    if (NewMode == RTC_CLOCK_MODE) {
        /* Select PAGE0 */
        TSB_RTC->PAGER = tmp;

        do {
            tmp = TSB_RTC->HOURR;
            mode = TSB_RTC->HOURR;
        }
        while (tmp != mode);

    } else {
        /* Select PAGE1 */
        tmp |= PAGER_PAGE_SET;
        TSB_RTC->PAGER = tmp;
        tmp = TSB_RTC->HOURR;
    }

